000000*/*
000000* * CSCI3180 Principles of Programming Languages
000000* *
000000* * --- Declaration ---
000000* *
000000* * I declare that the assignment here submitted is original except for source
000000* * material explicitly acknowledged. I also acknowledge that I am aware of
000000* * University policy and regulations on honesty in academic work, and of the
000000* * disciplinary guidelines and procedures applicable to breaches of such policy
000000* * and regulations, as contained in the website
000000* * http://www.cuhk.edu.hk/policy/academichonesty/
000000* *
000000* * Assignment 1
000000* * Name : Lam King Fung
000000* * Student ID : 1155108968
000000* * Email Addr : kflam8@cse.cuhk.edu.hk
000000* */
000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID.   TA_RANKING.
000030 AUTHOR        LAM KING FUNG.
000040 
000050 ENVIRONMENT DIVISION.
000051
000060 INPUT-OUTPUT SECTION.
000061*FILE I/O
000070 FILE-CONTROL.
000080     SELECT CANDIDATES ASSIGN TO 'candidates.txt'
000081       ORGANIZATION IS LINE SEQUENTIAL
000082       FILE STATUS IS CAN-FS.
000090     SELECT INSTRUCTORS ASSIGN TO 'instructors.txt'
000091       ORGANIZATION IS LINE SEQUENTIAL
000092       FILE STATUS IS INS-FS.
000100     SELECT OUTFILE ASSIGN TO 'output.txt'
000101       ORGANIZATION IS BINARY SEQUENTIAL.
000110 
000120 DATA DIVISION.
000121
000130 FILE SECTION.
000131*CREATE STRCTURE OF CANDIDATES
000140 FD CANDIDATES.
000150 01 CAN-RECORD.
000160     03 SID PIC X(11).
000170     03 SKILLS.
000180         05 SKILL1 PIC X(15).
000190         05 SKILL2 PIC X(15).
000200         05 SKILL3 PIC X(15).
000210         05 SKILL4 PIC X(15).
000220         05 SKILL5 PIC X(15).
000230         05 SKILL6 PIC X(15).
000240         05 SKILL7 PIC X(15).
000250         05 SKILL8 PIC X(15).
000260     03 PREFERRED.
000270         05 1ST PIC X(5).
000280         05 2ND PIC X(5).
000290         05 3RD PIC X(5).
000291
000300 FD INSTRUCTORS.
000301*CREATE STRCTURE OF COURSES
000310 01 INS-RECORD.
000320     03 COURSE-CODE PIC X(5).
000330     03 REQUIRED-SKILLS.
000340         05 RSKILL1 PIC X(15).
000350         05 RSKILL2 PIC X(15).
000360         05 RSKILL3 PIC X(15).
000370     03 OPTIONAL-SKILLS.
000380         05 OSKILL1 PIC X(15).
000390         05 OSKILL2 PIC X(15).
000400         05 OSKILL3 PIC X(15).
000410         05 OSKILL4 PIC X(15).
000420         05 OSKILL5 PIC X(15).
000430
000440 FD OUTFILE.
000441*CREATE STRCTURE OF OUTPUT FILE
000450 01 OUTPUT-RECORD.
000460     03 COURSE-CODE PIC X(5).
000470*     03 RANKINGS.
000480     03 RANK1 PIC X(11).
000500     03 RANK2 PIC X(11).
000520     03 RANK3 PIC X(11).
000521     03 E-O-L PIC X.
000540 
000550 WORKING-STORAGE SECTION.
000560 01 CAN-FS PIC 99.
000570 01 INS-FS PIC 99.
000580 01 TA-RANKING-SCORE-TABLE.
000590     03 TA-RANKING-SCORE PIC 9V9 OCCURS 3 TIMES VALUE ZERO.
000591 01 ERROR-MSG PIC X(18) VALUE 'non-existing file!'.
000592 01 TEMPSID PIC X(11) VALUE '0000000000 '.
000590
000600 PROCEDURE DIVISION.
000610 MAIN-PARAGRAPH.
000620     OPEN INPUT INSTRUCTORS CANDIDATES.
000630     GO TO INSTRUCTOR-EXIST.
000640 
000645*CHECK IF FILE EXISTS
000646*CHECK IF INSTRUCTORS.TXT EXIST
000650 INSTRUCTOR-EXIST.
000660     IF INS-FS NOT = 35 THEN
000670         GO TO CANDIDATES-EXIST
000680     END-IF.
000690     DISPLAY ERROR-MSG.
000700     GO TO EXIT-PROGRAM.
000705
000706*CHECK IF CANDIDATES.TXT EXIST
000709 CANDIDATES-EXIST.
000710     IF CAN-FS NOT = 35 THEN
000720         GO TO TA-SELECTION
000730     END-IF.
000740     DISPLAY ERROR-MSG.
000750     GO TO EXIT-PROGRAM.
000760
000770 CANDIDATES-EMPTY
000780     DISPLAY INS-FS.
999990
999991 EXIT-PROGRAM.
999992     CLOSE INSTRUCTORS CANDIDATES.
999999     STOP RUN.